accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/customers/GetAllCustomerContracts-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/AccountManagement/GetAllCustomerContracts">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetAllCustomerContractsResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:ContractsSearch>
                  <get:SearchIsComplete>?</get:SearchIsComplete>
                  <get:contracts>
                     <!--Zero or more repetitions:-->
                     <get:contractsList>
                        <get:SubmId>?</get:SubmId>
                        <get:RpCode>?</get:RpCode>
                        <get:AdrStreet>?</get:AdrStreet>
                        <get:Type>?</get:Type>
                        <get:CsCode>?</get:CsCode>
                        <get:AdrLname>?</get:AdrLname>
                        <get:AdrName>?</get:AdrName>
                        <get:AdrFname>?</get:AdrFname>
                        <get:CoIdPub>?</get:CoIdPub>
                        <get:CoId>?</get:CoId>
                        <get:CsId>?</get:CsId>
                        <get:CoActivated>
                           <get:day>?</get:day>
                           <get:month>?</get:month>
                           <get:year>?</get:year>
                        </get:CoActivated>
                        <get:BuId>?</get:BuId>
                        <get:CoStatus>?</get:CoStatus>
                        <get:ExternalInd>?</get:ExternalInd>
                        <get:Dirnum>?</get:Dirnum>
                        <get:PlCode>?</get:PlCode>
                        <get:VpnId>?</get:VpnId>
                        <get:AdrStreetNo>?</get:AdrStreetNo>
                        <get:CoType>?</get:CoType>
                        <get:Description>?</get:Description>
                        <get:AdrZip>?</get:AdrZip>
                        <get:AdrCity>?</get:AdrCity>
                     </get:contractsList>
                  </get:contracts>
               </get:ContractsSearch>
            </lcew:Body>
         </Response>
      </web:GetAllCustomerContractsResponse>
   </soapenv:Body>
</soapenv:Envelope>